<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

namespace app\dict\scan;

class ScanDict
{
    /************************************************* 请求消息的属性 *****************************************/

    //状态
    const WAIT = 'wait';
    const SUCCESS = 'success';
    const FAIL = 'fail';



    const WECHAT_LOGIN = 'wechat_login';//微信登录




}