<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

return [
    //系统常用
    100000 => 'success',
    100001 => 'save success',
    100002 => 'update success',
    100003 => 'delete success',
    100004 => 'refresh success',
    100005 => 'fail',
    100006 => 'save fail',
    100007 => 'update fail',
    100008 => 'delete fail',
    100009 => 'refresh fail',
    100010 => 'add fail',
    100011 => 'add success',
    100012 => 'upload fail',
    100013 => 'file delete fail',
    100014 => 'data is not exit',
    100015 => 'download fail',
    100016 => 'set success',
    100017 => 'agreement type is not exit',
    100018 => 'cloumn is not exit',
    100019 => 'refresh success',
    100020 => 'captcha fail',


    //登录注册重置账号....

    101000 => 'login success',
    101001 => 'place login',
    101002 => 'login expire',
    101003 => 'login expire',
    101004 => 'account is not auth',
    101005 => 'account or password error',
    102006 => 'you do not have auth',
    102007 => 'site is not exit',
    102008 => 'logout',
    102009 => 'password error',
    102010 => 'mobile login is not open',

    //用户组权限

    102000 => 'you do not have auth',



    //菜单管理
    200001 => '菜单不存在',
    200002 => '存在子级菜单的目录或菜单不允许删除',

    //用户管理
    201001 => '用户不存在',
    201002 => '用户不存在关联权限',
    201003 => '超级管理员不允许改动权限',
    201004 => '用户名重复',


    //角色管理
    202001 => '角色不存在',
    202002 => '存在管理员使用当前角色,不允许删除',

    //素材管理
    203001 => '附件组不存在',
    203002 => '当前分组,不允许删除',
    203003 => '附件不存在',
    203004 => '附件组中存在图片不允许删除',
    203005 => '云存储类型不存在',
    203006 => '获取不到网址指向的文件',
    203007 => '请选择要删除的图片',
    203008 => '不是有效的证书类型',


    //消息管理
    204001 => '消息类型不存在',
    204002 => '短信类型不存在',
    204003 => '短信驱动不存在',
    204004 => '没有启用的短信',
    204005 => '短信没有启用',
    204006 => '微信模板消息没有启用',
    204007 => '微信小程序订阅没有启用',
    204008 => '没有启用的短信方式',
    204009 => '消息模板不存在',
    204010 => '微信消息模板缺少模板编号',

    //会员相关
    301001 => '手机号已存在',
    301002 => '账户余额不足',
    301003 => '账号或密码错误',
    301004 => '账号被锁定',
    301005 => '账号不存在',
    301006 => '账号退出',
    301007 => '账户类型不存在',
    301008 => '账号已存在',
    301009 => '无效的注册渠道',
    301010 => '未开始账号登录注册',
    301011 => '未开启第三方登录注册',
    301012 => '手机号必须填写',
    301013 => '手机验证码有误',




    //渠道相关  占用 4******
    //微信
    400000 => '微信公众号未配置完善',
    400001 => '关键词回复不存在',
    400002 => '微信授信信息不存在',
    //小程序
    410000 => '微信小程序未配置完善',

    //支付相关
    500000 => '你选择的支付方式未启用',
    //站点相关
    600001 => '站点分组已存在站点，请调整站点后重试',

];
