<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

return [
    //默认驱动
    'default' => 'aliyun',
    //驱动厂商列表及参数-短信
    'drivers' => [
        //阿里云
        'aliyun' => [
            'driver' => 'core\sms\Aliyun',  //反射类的名字
            'app_key' => '',
            'secret_key' => '',
            'sign' => '',
        ],
        //腾讯云
        'tencent' => [
            'secret_id' => '',
            'secret_key' => '',
            'sign' => '',
            'app_id' => '',
        ]
    ]
];
