<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

return [
    //系统常用
    100000 => '操作成功',
    100001 => '保存成功',
    100002 => '修改成功',
    100003 => '删除成功',
    100004 => '更新成功',
    100005 => '操作失败',
    100006 => '保存失败',
    100007 => '修改失败',
    100008 => '删除失败',
    100009 => '更新失败',
    100010 => '添加失败',
    100011 => '添加成功',
    100012 => '上传失败',
    100013 => '附件删除失败',
    100014 => '数据不存在',
    100015 => '下载失败',
    100016 => '设置成功',
    100017 => '协议类型不存在',
    100018 => '找不到要修改的字段',
    100019 => '刷新成功',
    100020 => '验证码有误',


    //登录注册重置账号....

    101000 => '登录成功',
    101001 => '请登录',
    101002 => '登录过期,请重新登录',
    101003 => '登录状态有误,请重新登录',
    101004 => '账号被限制',
    101005 => '账号或密码错误',
    102006 => '您没有当前站点的访问权限',
    102007 => '站点不存在',
    102008 => '登陆退出',
    102009 => '原始密码不正确',
    102010 => '手机号登录注册未开启',

    //用户组权限

    102000 => '您没有访问权限',



    //菜单管理
    200001 => '菜单不存在',
    200002 => '存在子级菜单的目录或菜单不允许删除',

    //用户管理
    201001 => '用户不存在',
    201002 => '用户不存在关联权限',
    201003 => '超级管理员不允许改动权限',
    201004 => '用户名重复',


    //角色管理
    202001 => '角色不存在',
    202002 => '存在管理员使用当前角色,不允许删除',

    //素材管理
    203001 => '附件组不存在',
    203002 => '当前分组,不允许删除',
    203003 => '附件不存在',
    203004 => '附件组中存在图片不允许删除',
    203005 => '云存储类型不存在',
    203006 => '获取不到网址指向的文件',
    203007 => '请选择要删除的图片',
    203008 => '不是有效的证书类型',
    203009 => '远程资源文件地址不能为空',
    203010 => 'base图片资源不能为空',


    //消息管理
    204001 => '消息类型不存在',
    204002 => '短信类型不存在',
    204003 => '短信驱动不存在',
    204004 => '没有启用的短信',
    204005 => '短信没有启用',
    204006 => '微信模板消息没有启用',
    204007 => '微信小程序订阅没有启用',
    204008 => '没有启用的短信方式',
    204009 => '消息模板不存在',
    204010 => '微信消息模板缺少模板编号',
    204011 => '当前消息未开启短信发送',

    //会员相关
    301001 => '手机号已存在',
    301002 => '账户余额不足',
    301003 => '账号或密码错误',
    301004 => '账号被锁定',
    301005 => '账号不存在',
    301006 => '账号退出',
    301007 => '账户类型不存在',
    301008 => '账号已存在',
    301009 => '无效的注册渠道',
    301010 => '未开始账号登录注册',
    301011 => '未开启第三方登录注册',
    301012 => '手机号必须填写',
    301013 => '手机验证码有误',
    301014 => '当前账号已绑定授权',
    301015 => '无效的短信验证码',
    301016 => '第三方授权标识不能为空',
    301017 => '密码重置成功',
    301018 => '当前填写的手机号没有绑定此账号',
    301019 => '当前填写的手机号不存在账号',
    301020 => '当前账号已绑定手机号',
    301021 => '登录二维码失效',

    //会员提现
    302001 => '会员提现业务未开启',
    302002 => '会员提现金额不能小于系统所配置的最低提现金额',
    302003 => '当前会员提现方式未启用',
    302004 => '提现记录不存在',
    302005 => '当前提现记录已被审核',
    302006 => '存在未定义的转账方式',
    302007 => '提现被拒绝,返还零钱',
    302008 => '会员申请提现,扣除零钱',
    302009 => '会员提现金额不能小于最低提现金额',
    302010 => '当前提现申请未处于待转账状态',
    302011 => '当前提现申请未处于待审核状态',
    302012 => '会员提现转账',


    //渠道相关  占用 4******
    //微信
    400000 => '微信公众号未配置完善',
    400001 => '关键词回复不存在',
    400002 => '微信授权信息不存在',
    400003 => '扫码成功',
    //小程序
    410000 => '微信小程序未配置完善',
    410001 => '微信小程序授信信息不存在',
    410002 => '微信小程序授信手机号不存在',

    //支付相关

    //站点相关
    600001 => '站点分组已存在站点，请调整站点后重试',


    //支付相关(todo  注意:7段不共享)
    700000 => '无效的支付交易号',
    700001 => '您选择到支付方式不受业务支持',
    700002 => '支付中,请稍后再试',
    700003 => '当前支付已完成',
    700004 => '当前支付已取消',
    700005 => '你选择的支付方式未启用',
    700006 => '你选择的支付方式不适用于当前场景',
    700007 => '只有待支付时可以关闭',
    700008 => '当前转账未处于待转账状态',
    700009 => '无效的转账单据',
    700010 => '参数有误或未开通转账业务',

    //订单相关  8***
    800000 => '订单不存在',

];
