<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

use think\facade\Route;

/**
* 路由（注意最好group路由名称与插件名称一致，防止路由冲突）
*/
Route::group("hello_world", function () {
Route::get('index', 'addon\hello_world\app\adminapi\controller\Index@index');
});